{"config": [{"config": {"use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "dtype": "float32", "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "filters": 20, "batch_input_shape": [null, 24, 24, 3], "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "strides": [1, 1], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "padding": "same", "filters": 50, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_constraint": null, "trainable": true, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 500, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"use_bias": true, "kernel_constraint": null, "trainable": true, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 2, "activation": "sigmoid", "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.5", "backend": "tensorflow"}