{"config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "trainable": true, "kernel_regularizer": null, "batch_input_shape": [null, 24, 24, 3], "kernel_size": [3, 3], "activation": "relu", "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 50, "name": "conv2d_1", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "rate": 0.25, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "activation": "relu", "units": 100, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "use_bias": true, "activation": "relu", "units": 50, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "use_bias": true, "activation": "sigmoid", "units": 2, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "name": "sequential_2"}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.4"}