{"class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_1", "kernel_constraint": null, "batch_input_shape": [null, 24, 24, 3], "filters": 50, "activation": "relu", "dtype": "float32", "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 100, "activation": "relu", "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 50, "activation": "relu", "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activity_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "activation": "sigmoid", "kernel_constraint": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}], "name": "sequential_2"}, "keras_version": "2.2.4", "backend": "tensorflow"}